<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Homework for Lesson 6</title>
    <style>
        body {
            max-width: 800;
        }
    </style>
</head>

<body>

    <h5>Заняття 6. Модифікатори доступу. Конструктор. Геттери та сеттери.</h5>
    <hr>

    <?php

    require_once __DIR__ . '/vendor/autoload.php';

    echo "<pre>",
    "
    1.	Не підглядаючи в мій код, внесіть такі ж правки до класу User.
    2.	Спробуйте спричинити метод, що використовуєтьсяназавжди зовні класу. Переконайтеся, що це викликатиме помилку.
    ",
    "</pre>";

    $user1 = new User(); //Створюємо нового юзера
    $user1->setName("John"); //Встановлюємо юзеру ім'я
    $user1->setAge(25); //Встановлюємо юзеру вік
    echo "Ім'я користувача: " . $user1->getName() . "<br />"; //Викликаєм ім'я юзера та виводим на екран
    echo "Вік користувача: " . $user1->getAge() . "<br />"; //Викликаєм вік юзера та виводим на екран
    try {
        $user1->setAge(70); //Спроба встановити юзеру вік, що не відповідає умовам 
    } catch (Exception $ex) {
        echo $ex->getMessage(); //Виводимо інформацію про виключення
    }
    echo "Вік користувача: " . $user1->getAge() . "<br />"; //Викликаєм вік юзера та виводим на екран
    //echo user1->isAgeCorrect(); //Виклик приватного метода класа ззовні призводит до помилки 

    echo "<hr />";

    echo "<pre>",
    "
    3.  Зробіть клас Student із властивостями $name та $course (курс студента, від 1-го до 5-го).
    4.	У класі Student зробіть public метод transferToNextCourse, який перекладатиме студента на наступний курс.
    5.	Виконайте в методі transferToNextCourse перевірку на те, що наступний курс не більше 5.
    6.	Винесіть перевірку курсу в окремому приватному методі.
    ",
    "</pre>";
    $student1 = new Student("Rick", 5); //Створюємо нового студента
    echo $student1->getInfo(); //Виводимо інформацію про студента на екран
    $student1->transferToNextCourse(); //Спроба перевести студента на наступній курс
    echo $student1->getInfo(); //Виводимо інформацію про студента на екран

    echo "<hr />";

    echo "<pre>",
    "
    7.	Зробіть клас Employee, у якому будуть такі громадські характеристики - name, age, salary.
    Зробіть те щоб ці властивості заповнювалися в конструкторі під час створення об'єкта.
    8.	Створіть об'єкт класу Employee з ім'ям eric, віком 25, зарплатою 1000.
    9.	Створіть об'єкт класу Employee з ім'ям kyle, віком 30, зарплатою 2000.
    10.	Виведіть на екран суму зарплат створених вами користувачів.
    ",
    "</pre>";
    $employee1 = new EmployeePublic("Eric", 25, 1000); //Створюємо нового робітника
    echo $employee1->getInfo(); //Виводимо інформацію про робітника на екран 
    $employee2 = new EmployeePublic("Kyle", 30, 2000); //Створюємо нового робітника
    echo $employee2->getInfo(); //Виводимо інформацію про робітника на екран
    echo "Сума зарплат працівників {$employee1->getName()} та {$employee2->getName()} складає: " . ($employee1->getSalary() + $employee2->getSalary()) . "$" . "<br />";

    echo "<hr />";

    echo "<pre>",
    "
    11.	Зробіть клас Employee, де будуть наступні приватні властивості: name, age та salary.
    12.	Зробіть геттери та сетери для всіх властивостей класу Employee.
    13.	Доповніть клас Employee приватним методом isAgeCorrect, який перевірятиме вік на коректність 
    (від 1 до 100 років). Цей метод повинен використовуватися в сеттері setAge перед встановленням нового
    віку (якщо вік не коректний – він не повинен змінюватися).
    14.	Нехай зарплата наших працівників зберігається у доларах. Зробіть так, щоб гетер getSalary додав у
    кінець числа із зарплатою значок долара. Говорячи іншими словами у якості salary зарплата буде зберігатися
    просто числом, але геттер буде повертати її з доларом на кінці.
    ",
    "</pre>";

    $employee3 = new EmployeePrivate(); //Створюємо нового робітника
    $employee3->setName("Bob"); //Встановлюємо робітнику ім'я
    $employee3->setAge(63); //Встановлюємо робітнику вік
    $employee3->setSalary(2800); //Встановлюємо робітнику зарплатню
    echo $employee3->getInfo(); //Виводимо інформацію про робітника на екран
    try {
        $employee3->setAge(107); //Спроба присвоїти значення, що не відповідає умовам.
    } catch (Exception $ex) {
        echo $ex->getMessage(); //Виводимо інформацію про виключення
    }
    echo $employee3->getInfo(); //Виводимо інформацію про робітника на екран

    echo "<hr />";
    ?>

</body>

</html>